Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/legal_matters_and_health/advance_care_directives.html.txt.tmx
Source language: en
Languages: ga

source: An Advance Healthcare Directive, sometimes known as a 'Living will', is a statement about the type and extent of medical or surgical treatment you want in the future, on the assumption that you will not be able to make that decision at the relevant time
ga: Is ráiteas é réamhthreoir cúraim, ar a dtugtar ‘Uacht beo uaireanta’, maidir leis an gcineál agus an méid córa leighis nó máinliachta a bheidh ag teastáil uait sa todhchaí, de bhun na toimhdean nach mbeidh sé de chumas agat an cinneadh sin a dhéanamh ag an am ábhartha

source: There are a number of different words and phrases used to describe advance care directives
ga: Úsáidtear roinnt focal agus friotal éagsúil chun cur síos a dhéanamh ar réamhthreoracha cúraim

source: In some countries, there is legislation which provides for the recognition and enforcement of such directives and in some cases provides for the way in which they should be made
ga: I dtíortha áirithe, tá reachtaíocht ann lena ndéantar foráil chun treoracha dá leithéid a aithint agus a fhorfheidhmiú agus lena ndéantar foráil i gcásanna áirithe don chaoi ar cheart iad a dhéanamh. Níl aon reachtaíocht dá leithéid in Éirinn

source: The Assisted Decision-Making (Capacity) Act 2015 provides laws for Advance Healthcare Directives
ga: Ní gá gur ionann é seo is nach bhfuil na réamhthreoracha bailí ach ciallaíonn sé go dtarlódh nach mbeadh faisnéis ná treoir ó dhlínsí eile infheidhmithe agus nár cheart duit brath ar fhaisnéis ná ar threoir dá leithéid

source: The Act was signed into law on 30 December 2015 but has not yet been commenced to bring it into effect. Read more about the Act (pdf). This document describes the situation before the Act comes into operation
ga: Bhí cásanna cúirte ann i roinnt tíortha ina ndearnadh breithniú ar bhailíocht réamhthreoracha ach arís, ní raibh cás dá leithéid in Éirinn riamh

source: An Advance Healthcare Directive may be valid and enforceable because by making such a statement you may have withdrawn your consent to specific medical or surgical treatment
ga: D’fhéadfadh réamhthreoir cúraim bheith bailí agus infheidhmithe dá mba rud é go mbeadh do thoilíocht maidir le cóireáil leighis nó mháinliachta shainiúil tarraingthe siar agat i ráiteas dá leithéid

source: It is not possible to state with absolute certainty that such a directive would be enforced because this depends on exactly what it says and whether or not it addresses the precise circumstances you face
ga: Ní féidir a rá go cinnte go ndéanfaí treoir dá leithéid a fhorfheidhmiú ós rud é go mbraitheann sé ar a bhfuil ráite inti agus cé acu an mbaineann sí nó nach mbaineann sí leis na himthosca áirithe atá i gceist

source: In some countries it is possible to appoint someone else to make decisions on your behalf if you are not capable of making them yourself
ga: I dtíortha áirithe is féidir duine éigin eile a cheapadh chun cinntí a dhéanamh ar do shon sa chás nach mbeifeá in ann iad a dhéanamh duit féin

source: In Ireland this power is granted by creating an Enduring Power of Attorney
ga: In Éirinn déantar an chumhacht seo a thabhairt trí Cumhacht Bhuan Aturnae a chruthú

source: An Enduring Power of Attorney however specifically does not allow for the making of healthcare decisions by another person
ga: Ní cheadaíonn Cumhacht Bhuan Aturnae go sonrach do dhuine éigin eile, áfach, cinntí maidir le cúram sláinte a dhéanamh

source: While you may suggest to your doctor or hospital that the wishes of certain people may be taken into account, you cannot give anyone else any legal right to make decisions about your healthcare
ga: Cé gur féidir leat moladh a thabhairt do do dhochtúir nó do d’ospidéal gur cheart mianta daoine áirithe a thabhairt san áireamh, ní féidir leat aon cheart dlíthiúil a thabhairt do dhuine ar bith cinntí a dhéanamh maidir le do chúram sláinte

source: Neither can you ensure that the doctor/hospital will abide by their wishes
ga: Ina theannta sin, ní féidir leat áirithiú a dhéanamh go gcloífidh an dochtúir/an t-ospidéal lena mianta

source: What is an Advance Healthcare Directive?
ga: Cad is réamhthreoir cúraim ann?

source: In general it can be defined as a statement about the kind and extent of medical or surgical treatment you want in the future, on the assumption that you will not be able to make that decision at the relevant time
ga: Go ginearálta is féidir sainmhíniú a dhéanamh uirthi mar ráiteas maidir leis an gcineál agus an méid cóireála leighis nó máinliachta a bheidh ag teastáil uait sa todhchaí, de bhun na toimhdean nach mbeidh sé de chumas agat an cinneadh sin a dhéanamh ag an am ábhartha

source: Sometimes the terms living will, advance statement, advance decision or advance refusal are used
ga: Uaireanta, baintear leas as na téarmaí uacht bheo, réamhráiteas, réamhchinneadh nó réamhdhiúltú

source: Remember however, there are no precise definitions of these terms but they are all advance decisions about medical or surgical treatment
ga: Níl sainmhíniúcháin chruinne le fáil ar na téarmaí seo áfach, ach is réamhchinntí iad uile faoi chóireáil leighis nó mháinliachta

source: People usually make such directives to limit the treatment given in order not to prolong life, for example, a Do Not Resuscitate Order
ga: De ghnáth tugann daoine treoracha dá leithéid d’fhonn cóireáil leighis a theorannú ionas nach ndéanfaí beatha a fhadú

source: Some people however make them in order to state that they want all possible treatments to be provided
ga: Déanann roinnt daoine iad a thabhairt áfach le sonrú go dteastaíonn gach cóireáil leighis is féidir uathu

source: It is unlikely that such a directive would be enforceable as it does not take account of the likely success of the treatment or of the costs involved
ga: Is doiléir a stádas ós é nach bhfuil reachtaíocht ar bith ann maidir le treoracha ach ní gá gur ionann é sin is a rá go bhfuil siad neamhbhailí in Éirinn

source: There is no doubt that an advance directive is not enforceable if it specifies doing something which is illegal
ga: Ní ábhar amhrais é nach bhfuil réamhthreoir infheidhmithe má shonraíonn sí rud éigin atá mídhleathach

source: For example, an advance directive stating that you want to be given medication which will hasten your death would not be enforceable
ga: Mar shampla, ní bheadh réamhthreoir ag sonrú go dteastódh leigheas uait a chuirfeadh dlús le do bhás infheidhmithe

source: Withdrawal of treatment is not the same as positive action to end life
ga: Ní hionann cóireáil leighis a tharraingt siar is beart gníomhach a dhéanamh chun deireadh a chur le beatha

source: A directive which specifies the kind of treatment you want is unlikely to be enforceable, especially if it conflicts with the doctor's clinical decision
ga: Ní dealraitheach go mbeadh treoir ina sonraítear cineál na cóireála atá uait infheidhmithe go háirithe má thagann sé salach ar chinneadh cliniciúil an dochtúra

source: A directive is unlikely to be considered valid under circumstances which clearly were not envisaged when it was drawn up
ga: Ní dealraitheach go measfaí treoir a bheith bailí má bhaineann sí le himthosca nach raibh faoi chaibidil nuair a rinneadh í a dhréachtú

source: Family members and Advance Healthcare Directives
ga: Gaolta agus réamhthreoracha cúraim

source: If a healthcare issue arises and the patient is incapable of making a decision, it is the practice to consult with next of kin
ga: Is é an nós atá ann má thagann saincheist um chúram sláinte chun cinn gan é a bheith de chumas an othair cinneadh a dhéanamh ná comhairle a fháil ón neasghaol

source: It is not clear what legal basis there is for this, as next of kin have no general right to make decisions on behalf of adults
ga: Ní léir cén bunús dlíthiúil atá leis seo nó níl aon cheart i gcoitinne ag neasghaol cinntí a dhéanamh thar ceann aosach

source: Medical ethics currently in force in Ireland state that consultation with next of kin is desirable if the patient is unable to make a decision or to communicate and provides for a second opinion if there is a difference of opinion between your family and the doctor
ga: Sonraítear de réir na heitice míochaine atá i bhfeidhm faoi láthair gur inmhianaithe é comhairle a fháil ón neasghaol mura bhfuil an t-othar in ann cinneadh ná cumarsáid a dhéanamh agus tugtar dara tuairim ar an ndóigh seo má tá easaontas idir do mhuintir agus an dochtúir

source: Next of kin are (in order) spouses, children, parents, siblings
ga: Is iad atá i neasghaolta (in ord tosaíochta) ná céilí, leanaí, tuismitheoirí, siblíní

source: Partners have no legal status and may experience difficulties in seeing patients if family members object
ga: Is ionann é an cás seo is cuma tú a bheith i gcaidreamh heitrighnéasach nó homaighnéasach

source: Section 69(2) of the Medical Practitioners Act 1978 provides that the Irish Medical Council is obliged to provide guidance to the medical profession in Ireland regarding medical ethics
ga: Foráiltear in Alt 69(2) d’Acht na Lia-chleachtóirí 1978 go bhfuil sé ar Chomhairle na nDochtúirí Leighis treoir a thabhairt don ghairm mhíochaine in Éirinn maidir le heitic mhíochaine

source: The Council have a Guide to Professional Conduct and Ethics for Registered Medical Practitioners
ga: Tá Treoir um Iompar Eiticiúil (Guide to Ethical Conduct and Behaviour) ag an gComhairle

source: Suicide and Assisted Suicide
ga: Féinmharú agus Féinmharú Cuidithe

source: You are entitled to refuse medical treatment but this does not mean that you may take positive measures to end your own life or another person's life
ga: Tá sé de cheart agat cóireáil leighis a dhiúltú ach ní hionann é sin agus ceart chun bearta gníomhacha a ghlacadh chun deireadh a chur le do bheatha féin nó le beatha duine eile

source: The Criminal Law (Suicide) Act 1993 sets out the law in relation to suicide
ga: Leagtar amach an dlí maidir le féinmharú san Acht um an Dlí Coiriúil (Féinmharú) 1993

source: Suicide itself or an attempt to commit suicide is not a crime
ga: Ní coir é féinmharú ná iarracht chun féinmharú a thabhairt chun críche

source: However, it is a criminal offence to help another person to take measures to end their life
ga: Is coir é, áfach, cúnamh a thabhairt do dhuine eile bearta a ghlacadh le gur féidir leo deireadh a chur lena bheatha féin

source: It is a criminal offence to aid, abet, encourage or procure the suicide of another person
ga: Is cion coiriúil é cabhrú, neartú, spreagadh nó soláthar a dhéanamh maidir le féinmharú duine eile

source: That crime is usually referred to as assisted suicide
ga: Is éard a thugtar ar an gcoir sin de ghnáth ná féinmharú cuidithe

source: The maximum penalty for assisted suicide is 14 years imprisonment
ga: 14 bliana príosúnachta atá sa phionós uasta a ghearrtar maidir le féinmharú cuidithe

source: If you help someone to commit suicide you may be charged with murder, manslaughter or assisted suicide depending on the exact circumstances
ga: Má thugann tú cúnamh do dhuine féinmharú a dhéanamh d’fhéadfaí tú a chúiseamh as dúnmharú, as dúnorgain nó as féinmharú cuidithe ag brath ar na himthosca

source: Such a charge could arise if you help another person to end their life even if the other person is terminally ill or wants to end their life. This applies to medical professionals in the same way as to other people
ga: D’fhéadfadh cúiseamh dá leithéid tarlú má chuidíonn tú le duine deireadh a chur lena bheatha féin fiú má tá tinneas foirceanta ar an duine nó má theastaíonn uaidh/uaithi deireadh a chur lena b(h)eatha

source: Pain killing drugs which may also shorten life may be administered if the intention is to deal with pain and not to end life
ga: Baineann sé seo le gairmithe míochaine ar an ndóigh chéanna is a bhaineann sé le daoine eile

source: Think Ahead aims to help people think about, discuss and record what their preferences are in the event of emergency, serious illness or death. You can download the Think Ahead Form that helps to guide you through this process
ga: Ceadaítear drugaí pianmhúcháin a d’fhéadfadh beatha a ghiorrú a thabhairt chomh fada is go ndéantar é seo chun dul i ngleic le pian seachas deireadh a chur le beatha
